---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExportFailures.SwitchToRasterProcessingInsteadOfVectorWarning
source: html/eb5973f2-6f73-40ea-3925-f8778712b2f6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExportFailures.SwitchToRasterProcessingInsteadOfVectorWarning Property

Some of the views have been switched to raster processing though vector processing is selected.

## Syntax (C#)
```csharp
public static FailureDefinitionId SwitchToRasterProcessingInsteadOfVectorWarning { get; }
```